#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.charing_history_exporter_function.data.external.archive_prepare[0]: Reading...
module.vehicle_data_function.data.external.archive_prepare[0]: Reading...
module.history_slicer_function.data.external.archive_prepare[0]: Reading...
module.lambda_layer_s3.data.external.archive_prepare[0]: Reading...
module.vehicle_data_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_layer_s3.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.charing_history_exporter_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_layer_s3.local_file.archive_plan[0]: Refreshing state... [id=2957ad9933a89650542111e1782bcb0900e51f00]
module.charing_history_exporter_function.local_file.archive_plan[0]: Refreshing state... [id=4fa2966c4b8f2ddcca52662d61cb3d3ee2a78322]
module.vehicle_data_function.local_file.archive_plan[0]: Refreshing state... [id=f6ccd04b3e3a8e4d5bf059e9d78b161d05ceb715]
module.history_slicer_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.charing_history_exporter_function.null_resource.archive[0]: Refreshing state... [id=5916741136963600052]
module.history_slicer_function.local_file.archive_plan[0]: Refreshing state... [id=8b0f25e2036f08de617f38c1f28b9110d52161fe]
module.vehicle_data_function.null_resource.archive[0]: Refreshing state... [id=7429450520035928426]
module.lambda_layer_s3.null_resource.archive[0]: Refreshing state... [id=4873483794807148799]
module.history_slicer_function.null_resource.archive[0]: Refreshing state... [id=958490652944316662]
module.lambda_layer_s3.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.vehicle_data_function.data.aws_caller_identity.current: Reading...
module.history_slicer_function.data.aws_caller_identity.current: Reading...
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.history_slicer_function.data.aws_partition.current: Reading...
module.vehicle_data_function.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_region.current: Reading...
module.vehicle_data_function.data.aws_iam_policy_document.assume_role[0]: Reading...
data.aws_region.current: Reading...
module.history_slicer_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.vehicle_data_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.vehicle_data.aws_dynamodb_table.this[0]: Refreshing state... [id=vehicle-data]
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vehicle_data_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=tde-slicer]
aws_cloudwatch_event_rule.exporter: Refreshing state... [id=tesla-data-exporter20231001174846219100000001]
aws_ssm_parameter.email: Refreshing state... [id=/tesla-data-exporter/email]
module.charing_history_exporter_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tesla-data-exporter]
module.lambda_layer_s3.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=tesla-data-exporter]
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.charing_history_exporter_function.data.aws_region.current: Reading...
module.charing_history_exporter_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.history_slicer_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/history-slicer]
module.history_slicer_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.lambda_layer_s3.data.aws_partition.current: Reading...
module.lambda_layer_s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_layer_s3.data.aws_region.current: Reading...
module.lambda_layer_s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_s3_bucket.this: Refreshing state... [id=tesla-data-exporter20230820121120532200000002]
module.vehicle_data_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
aws_ssm_parameter.refresh_token: Refreshing state... [id=/tesla-data-exporter/refresh_token]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 0s [id=7eb60e703ce476dda79c3026f9e3373dcf661ed201b4d53471100e2f29a9e43d]
module.charing_history_exporter_function.data.aws_partition.current: Reading...
module.charing_history_exporter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.history_slicer_function.data.aws_region.current: Reading...
module.history_slicer_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vehicle_data_function.data.aws_region.current: Reading...
module.vehicle_data_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.charing_history_exporter_function.data.aws_caller_identity.current: Reading...
module.charing_history_exporter_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.s3_bucket.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
aws_cloudwatch_event_rule.vehicle_data: Refreshing state... [id=vehicle-data-20231008155115500600000001]
module.vehicle_data_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/vehicle-data]
module.history_slicer_function.aws_iam_role.lambda[0]: Refreshing state... [id=history-slicer]
module.vehicle_data_function.aws_iam_role.lambda[0]: Refreshing state... [id=vehicle-data]
module.charing_history_exporter_function.aws_iam_role.lambda[0]: Refreshing state... [id=tesla-data-exporter]
module.charing_history_exporter_function.data.aws_iam_policy_document.logs[0]: Reading...
module.history_slicer_function.data.aws_iam_policy_document.logs[0]: Reading...
module.charing_history_exporter_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2641778069]
module.vehicle_data_function.data.aws_iam_policy_document.logs[0]: Reading...
module.history_slicer_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=246046267]
module.charing_history_exporter_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/tesla-data-exporter-logs]
module.vehicle_data_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3290348192]
module.history_slicer_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/history-slicer-logs]
module.vehicle_data_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/vehicle-data-logs]
module.history_slicer_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=history-slicer-20231001174846812600000004]
module.charing_history_exporter_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tesla-data-exporter-20231001175840578300000002]
module.vehicle_data_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=vehicle-data-20231001174846802700000003]
data.aws_iam_policy_document.vehicle_data: Reading...
data.aws_iam_policy_document.vehicle_data: Read complete after 0s [id=1063026315]
data.aws_iam_policy_document.history_exporter: Reading...
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=tesla-data-exporter]
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=tesla-data-exporter]
module.vehicle_data_function.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/vehicle-data-0]
data.aws_iam_policy_document.history_slicer: Reading...
data.aws_iam_policy_document.history_exporter: Read complete after 0s [id=737768633]
data.aws_iam_policy_document.history_slicer: Read complete after 0s [id=780189618]
module.charing_history_exporter_function.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/tesla-data-exporter-0]
module.history_slicer_function.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/history-slicer-0]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=tesla-data-exporter]
module.lambda_layer_s3.aws_s3_object.lambda_package[0]: Refreshing state... [id=lambda-builds/228f2987bafb82a1030e47cd34e467c311d8a3270893d858ee01a11d7b35d965.zip]
module.vehicle_data_function.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=vehicle-data-20231006133831770300000001]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=tesla-data-exporter,private]
module.history_slicer_function.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=history-slicer-20231006133831811200000002]
module.charing_history_exporter_function.aws_iam_role_policy_attachment.additional_jsons[0]: Refreshing state... [id=tesla-data-exporter-20231006133831825800000003]
module.lambda_layer_s3.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:25]
module.charing_history_exporter_function.aws_lambda_function.this[0]: Refreshing state... [id=tesla-data-exporter]
module.history_slicer_function.aws_lambda_function.this[0]: Refreshing state... [id=history-slicer]
module.vehicle_data_function.aws_lambda_function.this[0]: Refreshing state... [id=vehicle-data]
module.charing_history_exporter_function.aws_lambda_permission.unqualified_alias_triggers["EveryEightHours"]: Refreshing state... [id=EveryEightHours]
aws_cloudwatch_event_target.exporter: Refreshing state... [id=tesla-data-exporter20231001174846219100000001-terraform-20231001175918661000000004]
module.charing_history_exporter_function.aws_lambda_permission.current_version_triggers["EveryEightHours"]: Refreshing state... [id=EveryEightHours]
module.history_slicer_function.aws_lambda_permission.current_version_triggers["s3"]: Refreshing state... [id=s3]
module.history_slicer_function.aws_lambda_permission.unqualified_alias_triggers["s3"]: Refreshing state... [id=s3]
aws_s3_bucket_notification.slicer: Refreshing state... [id=tesla-data-exporter20230820121120532200000002]
module.vehicle_data_function.aws_lambda_permission.current_version_triggers["EveryHour"]: Refreshing state... [id=EveryHour]
module.vehicle_data_function.aws_lambda_permission.unqualified_alias_triggers["EveryHour"]: Refreshing state... [id=EveryHour]
aws_cloudwatch_event_target.vehicle_data: Refreshing state... [id=vehicle-data-20231008155115500600000001-terraform-20231008155137946600000002]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3_bucket.aws_s3_bucket.this[0] has changed
  ~ resource "aws_s3_bucket" "this" {
      ~ bucket_regional_domain_name = "tesla-data-exporter.s3.amazonaws.com" -> "tesla-data-exporter.s3.us-east-1.amazonaws.com"
        id                          = "tesla-data-exporter"
        tags                        = {}
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.charing_history_exporter_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "./.terraform/lambda_builds/5a4c88fdafc6b51b02b43d4ae31adb9376010ac30962cd01a73eaa2a56c4b6f2.zip" -> "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.zip"
      ~ handler                        = "export_history.handler" -> "lambda_handlers.run_charge_history_exporter"
        id                             = "tesla-data-exporter"
      ~ last_modified                  = "2023-10-08T19:04:15.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:25",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter:25" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter:25/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "25" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.charing_history_exporter_function.aws_lambda_permission.current_version_triggers["EveryEightHours"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "EveryEightHours" -> (known after apply)
      ~ qualifier           = "25" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.charing_history_exporter_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda_builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../lambda/src",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.zip"
              + runtime       = "python3.10"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.plan.json"
      + id                   = (known after apply)
    }

  # module.charing_history_exporter_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5916741136963600052" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "./.terraform/lambda_builds/5a4c88fdafc6b51b02b43d4ae31adb9376010ac30962cd01a73eaa2a56c4b6f2.zip" -> "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.zip"
          ~ "timestamp" = "1696791837701394000" -> "1700927273212376200"
        }
    }

  # module.history_slicer_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "./.terraform/lambda_builds/4deff5a45418ed6a70bddc9fb22480ec8dff88ece629bdbbd524770d7d71be51.zip" -> "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.zip"
      ~ handler                        = "slice_history.handler" -> "lambda_handlers.run_history_slicer"
        id                             = "history-slicer"
      ~ last_modified                  = "2023-10-08T19:04:15.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:25",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:history-slicer:25" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:history-slicer:25/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "25" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.history_slicer_function.aws_lambda_permission.current_version_triggers["s3"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "s3" -> (known after apply)
      ~ qualifier           = "25" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.history_slicer_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda_builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../lambda/src",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.zip"
              + runtime       = "python3.10"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.plan.json"
      + id                   = (known after apply)
    }

  # module.history_slicer_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "958490652944316662" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "./.terraform/lambda_builds/4deff5a45418ed6a70bddc9fb22480ec8dff88ece629bdbbd524770d7d71be51.zip" -> "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.zip"
          ~ "timestamp" = "1696791837555432000" -> "1700927273234263000"
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:25" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-10-08T19:04:15.206+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:25" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies" -> (known after apply)
      ~ s3_key                      = "lambda-builds/228f2987bafb82a1030e47cd34e467c311d8a3270893d858ee01a11d7b35d965.zip" -> "lambda-builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip" # forces replacement
      ~ s3_object_version           = "u363JLqOlmJzu8NuYJjok_zkKw1kpY2g" # forces replacement -> (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "NsauMtenJupVmtEO+FRPkxnq6+BNvMj0JVsD7IrfKnw=" -> (known after apply)
      ~ source_code_size            = 14558553 -> (known after apply)
      ~ version                     = "25" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "784fe236f7ee66d12fdefdc2f9082024-3" -> (known after apply)
      ~ id                     = "lambda-builds/228f2987bafb82a1030e47cd34e467c311d8a3270893d858ee01a11d7b35d965.zip" -> (known after apply)
      ~ key                    = "lambda-builds/228f2987bafb82a1030e47cd34e467c311d8a3270893d858ee01a11d7b35d965.zip" -> "lambda-builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "./.terraform/lambda_builds/228f2987bafb82a1030e47cd34e467c311d8a3270893d858ee01a11d7b35d965.zip" -> "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
      - tags                   = {} -> null
      ~ version_id             = "u363JLqOlmJzu8NuYJjok_zkKw1kpY2g" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda_builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../lambda/packages",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4873483794807148799" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "./.terraform/lambda_builds/228f2987bafb82a1030e47cd34e467c311d8a3270893d858ee01a11d7b35d965.zip" -> "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
          ~ "timestamp" = "1696791838301315000" -> "1700927273208808800"
        }
    }

  # module.vehicle_data_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "./.terraform/lambda_builds/06b68769b8814b47487dab5c88b988e5e94234a0e0b84732d569e9de7749c06d.zip" -> "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.zip"
      ~ handler                        = "vehicle_data_exporter.handler" -> "lambda_handlers.run_vehicle_data_exporter"
        id                             = "vehicle-data"
      ~ last_modified                  = "2023-10-08T19:04:30.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:25",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:vehicle-data:25" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:vehicle-data:25/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "25" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vehicle_data_function.aws_lambda_permission.current_version_triggers["EveryHour"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "EveryHour" -> (known after apply)
      ~ qualifier           = "25" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vehicle_data_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda_builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../lambda/src",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.zip"
              + runtime       = "python3.10"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.plan.json"
      + id                   = (known after apply)
    }

  # module.vehicle_data_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7429450520035928426" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "./.terraform/lambda_builds/06b68769b8814b47487dab5c88b988e5e94234a0e0b84732d569e9de7749c06d.zip" -> "./.terraform/lambda_builds/bf0065e2e44545917e239fb9358bcce3e5d68577465e4d0a03bc2685d44cf871.zip"
          ~ "timestamp" = "1696791837713592000" -> "1700927273207956000"
        }
    }

Plan: 13 to add, 3 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @cvanlaw, Action: `pull_request`*